<?php
//this file contains the definitions of text included in libs.html page

//HEAD
define("FAQ_PAGE_DESCRIPTION","Συχνές ερωτήσεις για το FidoCadJ και πως αυτό λειτουργεί. Πώς να το κατεβάσετε και να το χρησιμοποιήσετε δωρεάν για να σχεδιάσετε και να κοινοποιήσετε το έργο σας."); //page meta tag description

define("PAGE_TITLE","FidoCadJ Συχνές ερωτήσει"); //page title attribute

//CONTENT
define("PAGE_SUB_TITLE","Συχνές ερωτήσεις");

//FAQ INDEX
define("FAQ_INDEX_1","Τι είναι το FidoCadJ;");
define("FAQ_INDEX_2","Μπορώ να χρησιμοποιήσω το FidoCadJ για άλλες χρήσεις πέρα απο τα ηλεκτρονικά;");
define("FAQ_INDEX_3","Πόσο κοστίζει το FidoCadJ;");
define("FAQ_INDEX_4","Ποιές είναι οι απαιτήσεις για να τρέξω το FidoCadJ;");
define("FAQ_INDEX_5","Πως μπορώ να περιστρέψω τα σύμβολα;");
define("FAQ_INDEX_6","Γιατί το FidoCadJ είναι χρήσιμο για την ιστοσελίδα/Φόρουμ μου;");
define("FAQ_INDEX_7","Χρησιμοποιώ ήδη το Kicad, LTSpice, Cadence, Mentor, Altium και το Visio, γιατί το FidoCadJ είναι ενδιαφέρον;");
define("FAQ_INDEX_8","Το FidoCadJ δεν τρέχει ή είναι πολύ αργό, τι μπορώ να κάνω;");
define("FAQ_INDEX_9","Ο αριθμό έκδοσης είναι 0.κάτι. Είναι ένα μη σταθερό/ολοκληρομένο έργο;");
define("FAQ_INDEX_10","Πως μπορώ να συμμετέχω στην ανάπτυξη του;");

//FAQ
define("FAQ_TITLE_1","Τι είναι το FidoCadJ;");
define("FAQ_CONTENT_1","<p>Το FidoCadJ είναι ένας <b>απλός</b> διανυσματικό γραφικό πρόγραμμα επεξεργασίας. Μπορείτε να σχεδιάσετε οτιδήποτε επιθυμείτε, και το FidoCadJ έρχεται με μία μεγάλη βιβλιοθήκη συμβόλων που σχετίζονται με την ηλεκτρική και ηλεκτρονική μηχανική.</p>");

define("FAQ_TITLE_2","Μπορώ να χρησιμοποιήσω το FidoCadJ για άλλες χρήσεις πέρα απο τα ηλεκτρονικά;");
define("FAQ_CONTENT_2",'<p>Ναι, μπορείτε! Το FidoCadJ μπορεί να χρησιμοποιηθεί για<a href="http://www.matematicamente.it/forum/viewtopic.php?f=38&t=114624">Διαγράμματα</a>, <a href="http://www.electroyou.it/pepito/wiki/libreria-flowchart-per-fidocadj">διαγράμματα ροής</a> and <a href="http://www.electroyou.it/admin/wiki/peanuts-fidocadj">ακόμα και για κόμικς</a>.Στις <a href="http://darwinne.github.io/FidoCadJ/scrn.html">εικόνες οθόνης</a> έχετε κάποια παραδείγματα.</p>');

define("FAQ_TITLE_3","Πόσο κοστίζει το FidoCadJ;");
define("FAQ_CONTENT_3","<p>Τίποτα. Μηδέν. το FidoCadJ είναι ένα <b>Δωρεάν Λογισμικό</b>,κυκλοφόρησε με την έκδοση General Public License 3.</p>");

define("FAQ_TITLE_4","Ποιές είναι οι απαιτήσεις για να τρέξω το FidoCadJ;");
define("FAQ_CONTENT_4","<p>Χρειάζεστε έναν υπολογιστή με Java ".JAVA_VERSION_REQUIRED." εγκατεστημένη. Οποιοδήποτε λειτουργικό σύστημα μπορεί (Windows, Linux, MacOSX,...). Μπορείτε επίσης να εγκαταστήσετε το FidoCadJ σε Android τάμπλετ η κινητό τηλέφωνο (με έκδοση το λιγότερο 4.0).</p>");

define("FAQ_TITLE_5","Πως μπορώ να περιστρέψω τα σύμβολα;");
define("FAQ_CONTENT_5","<p>Πιέστε το R ή το S καθώς τα επεξεργάζεστε. Μπορείτε επίσης να το κάνετε απο το παραπάνω Επεξεργασία Αντικείμενα Μενού.</p>");

define("FAQ_TITLE_6","Γιατί το FidoCadJ είναι χρήσιμο για την ιστοσελίδα/Φόρουμ μου;");
define("FAQ_CONTENT_6","<p>Μπορείς να κοινοποιήσεις των πηγαίο κώδικα των σχεδιασμών σας. Είναι ένα απλό φορμάτ κειμένου με ολοκληρομένη περιγραφή στο FidoCadJ εγχειρίδιο<a href='https://github.com/DarwinNE/FidoCadJ/releases/download/v0.24.5/manual_en.pdf'>χρήσης</a>. Your users can pick it up, modifying the drawings as they wish and then upload them again.</p>");

define("FAQ_TITLE_7","Χρησιμοποιώ ήδη το Kicad, LTSpice, Cadence, Mentor, Altium και το Visio, γιατί το FidoCadJ είναι ενδιαφέρον;");
define("FAQ_CONTENT_7","<p>Επειδή είναι ένα<b>διαφορετικό πρόγραμμα</b>που ικανοποιεί διαφορετικούς σκοπούς.Είναι συμπληρωματικό με τα μεγάλα ηλεκτρονικά εργαλεία EDA. Προσπαθήσατε να συμπεριλάβετε τα σχήματά σας σε ένα έγγραφο ή σε μια παρουσίαση; Ήσασταν ευχαριστημένοι από το αποτέλεσμα;</p>
<p>Εάν θέλετε να δημοσιεύσετε και να μοιραστείτε τα σχέδιά σας και δεν ενδιαφέρεστε για τις δυνατότητες και την προσομοίωση του netlist, το FidoCadJ είναι το εργαλείο για εσάς. Είναι LaTeX-φιλικό: μπορείτε να εξάγετε σχέδια σε PGF/TikZ μορφή για να εισαχθούν στο έγγραφο σας.</p>");

define("FAQ_TITLE_8","Το FidoCadJ δεν τρέχει ή είναι πολύ αργό, τι μπορώ να κάνω;");
define("FAQ_CONTENT_8",'<p>Τις περισσότερες φορές εάν δεν μπορείτε να τρέξετε το FidoCadJ στο σύστημα μας, αυτό σημαίνει ότι η Java δεν έχει εγκατασταθεί επιτυχώς . Ένας το FidoCadJ τρέχει, αλλά είναι χαρακτηριστικά αργό, αύτο ίσως σημαίνει ότι η διαμόρφωση της Java δεν είναι η βέλτιστη.</p>
<p>Συνέβει στο παρελθόν με κάποιες διανομές Linux , ότι οι οδηγοί γραφικών έδωσαν απογοητευτική απόδοση με την Java. Εάν άλλες εφαρμογές java τρέχουν κανονικά, <a href="https://sourceforge.net/p/fidocadj/discussion/?source=navbar">επικοινωνήστε μαζί μας στο φόρουμ</a>.</p>');

define("FAQ_TITLE_9","Ο αριθμό έκδοσης είναι 0.κάτι. Είναι ένα μη σταθερό/ολοκληρομένο έργο;");
define("FAQ_CONTENT_9","<p>FidoCadJ στις μέρες μας είναι σε αρκετά <b>προχωρημένο στάδιο</b>. Το γεγονός ότι ο αριθμός έκδοσης ξεκινά με το 0 δεν έχει να κάνει με κάτι τέτοιο. Είναι απλώς μια σύμβαση. Οι μη σταθερές εκδόσεις ακολοθούνται απο ένα ελληνικό γράμμα.</p>
<p>Μπορείτε να τα δοκιμάσετε, αλλά σας προειδοποιούμε οτι μπορούν να εμφανιστούν κάποια σφάλματα απο εδώ και απο εκεί.</p>");

define("FAQ_TITLE_10","Πως μπορώ να συμμετέχω στην ανάπτυξη του;");
define("FAQ_CONTENT_10",'<p>Το FidoCadJ είναι ένα έργο <b>ανοιχτού λογισμικού</b>. Μπορείτε ευχαρίστως να δείτε <a href="https://github.com/DarwinNE/FidoCadJ">τον ολοκληρομένο κώδικα στο αποθετήριο του GitHub</a>.Επίσης αυτή η ιστοσελίδα είναι στο αποθετήριο.</p>
<p>Μπορείτε να αξιολογήσετε τον κώδικα, να εντοπίσετε σφάλματα, να προτείνετε βελτιώσεις στην εφαρμογή ή στην τεκμηρίωση αυτής. Να συνεισφέρετε ενεργά, με πρόσβαση να γράψετε στο αποθετήριο κώδικα, ωστόσο απαιτεί να διαβάσετε <a href="https://github.com/DarwinNE/FidoCadJ/blob/master/README">README</a> αρχείο, και να συζητήσετε με τους άλλους προγραμματιστές στο <a href="https://github.com/DarwinNE/FidoCadJ/issues">Issues</a>.</p>');
 ?>
